[
    {
        "content": "<p>Nu jā, te konktrēti ir problēma, ka sazīmē tukšos mežus un laukus un stūrus un tad pienāk lielā pilsētu zīmēšana un tur jau 3x reiz lēnāk un grūtāk. Vecie importi maisās, veco ortofoto šķībi, ēkas izmainījušās, tagadējais orto arī nav tik labs, utt.<br>\nEs personīgi būtu pa visu Latviju uztaisījis šito, lai katrs zīmē, kur grib. Saprotu protams no organizēšānas un piesaistes viedokļa, ka tad tas ir \"pa daudz\", bet nu...</p>",
        "id": 344355271,
        "sender_full_name": "HellMap",
        "timestamp": 1679687121
    },
    {
        "content": "<p>Šķiet, šis iederēsies atsevišķā tēmā.<br>\nJā, no platības viedokļa noteikti sākumā ies ātrāk. Vēlāk jau \"stratēģiska dalīšana\" būs svarīga, lai varētu apstrādājamos apjomos saskaldīt. Šobrīd nestrādājošā mazliet kavē.<br>\nBet nu kad/ja splitošanu sataisīs, atkal varēs pa bišķītim bīdīt uz priekšu.</p>\n<p>Vecie importi ir brīžiem apgrūtinoši, jā. Bet nu pozitīvi skatoties - pa maziem solīšiem no tiem vecajiem importiem paliek aizvien mazāk :)</p>",
        "id": 344357966,
        "sender_full_name": "Rihards Olups",
        "timestamp": 1679688099
    },
    {
        "content": "<p>Pa visu Latviju tādi trūkumi, ka var rasties \"nekad nepabeigs\" sajūta, un arī progresu praktiski neredzētu sākumā diezgan ilgi.</p>\n<p>Bet patiesībā tiešo to sākumā mēģināju uztaisīt :D<br>\nTik lielu reģionu neļāva nemaz. Tad mēģināju Latgali - arī bija par lielu.<br>\nŅemot vērā iepriekš minētos apsvērumus, tagad domāju, ka tas nemaz nebija slikti. Pa novadiem šādi varētu būt daudz biežāka sasnieguma sajūta.<br>\nIedomājies, cik forši būtu visu Rēzeknes novadu pabeigt, mmm.</p>",
        "id": 344358326,
        "sender_full_name": "Rihards Olups",
        "timestamp": 1679688240
    },
    {
        "content": "<p>Nezinu, vai jauna tēma, jo runāju konkrēti par Rēzeknes piepilsētu, bet nu...<br>\nJā, es to visu saprotu par dalīšanām un ierobežojumiem, bet personīgi man tā Latgale pie gala ar veco orto :) Tik pat labi varētu arī Ķīnā no Binga zīmēt (un es esmu zīmējis). Man personīgi reāli daudz labāk zīmējas tur, kur esmu bijis pats vai vismaz plānoju. Ar tādiem projektiem vienmēr problēma, ka ļoti plaši. Un es vēl kaut ko daru un pasaku feedback. Es domāju daudzi paskatās un uzreiz garām.</p>",
        "id": 344359207,
        "sender_full_name": "HellMap",
        "timestamp": 1679688614
    },
    {
        "content": "<p>Var sākt runāt ar pašvaldībām, varbūt kāda sirdij tuvāka gribēs būt nākamā :)</p>",
        "id": 344359451,
        "sender_full_name": "Rihards Olups",
        "timestamp": 1679688711
    },
    {
        "content": "<p>Piemēram, Rīga <span aria-label=\"troll\" class=\"emoji emoji-1f9cc\" role=\"img\" title=\"troll\">:troll:</span></p>",
        "id": 344359619,
        "sender_full_name": "HellMap",
        "timestamp": 1679688769
    },
    {
        "content": "<p>Jā, ar Rīgu interesanti - gadiem runā par datu atvēršanu, bet tad uztaisa dārgu portālu, kurā nemaz pašus datus neiedod :D<br>\nBūtu tik interesanti uzzināt, kas tur iekšienē notiek.</p>",
        "id": 344368975,
        "sender_full_name": "Rihards Olups",
        "timestamp": 1679692491
    }
]