[
    {
        "content": "<p>LĢIA dati - atvērti. Jāņa Sēta - autortiesībpaturēti. LĢIA objekts Bluķupe <a href=\"https://vietvardi.lgia.gov.lv/vv/to_www_obj.objekts?p_id=97851\">https://vietvardi.lgia.gov.lv/vv/to_www_obj.objekts?p_id=97851</a> avots \"Jāņa sēta\". Un kam tagad ticēt? Ja tā pavisam precīzi, tad LĢIA nebija tiesības taisīt savus datus atvērtus, kamēr to neļauj avoti. Vai arī viņiem ir kaut kādas speciālas licenzes, kur viņi saņem datus bez ierobežojumiem? Tad tālāk - Jāņa Sēta bieži izmanto OSM. Tātad obligāta atsauce uz OSM un citi nosacījumi. Ja tālāk iedot šādus datus ĻĢIA, kuru Jāņa Sēta nevar \"pārlicenzēt\", tad sanāk LĢIA izmanto OSM? <span aria-label=\"neutral\" class=\"emoji emoji-1f610\" role=\"img\" title=\"neutral\">:neutral:</span></p>",
        "id": 409718236,
        "sender_full_name": "HellMap",
        "timestamp": 1703338826
    },
    {
        "content": "<p>Ja avots ir karšu pārluks, tad neizklausās, ka saņemtu kā speciāli. Interesētu JS un LĢIA komentārs.</p>",
        "id": 409721138,
        "sender_full_name": "Dāvis Kļaviņš",
        "timestamp": 1703341526
    },
    {
        "content": "<p>Pieņemu, ka LĢIA vai nu nerūp autortiesības, vai arī viņiem ir kāds juridiskais pamatojums šādiem nelieliem info gūšanas gadījumiem.<br>\nJS oficiāli izmanto daļu OSM POI, neoficiāli... mmm... noteikti kaut ko vairāk :)<br>\nVai LĢIA jāliek OSM atsauce - labs jautājums, bet man ir aizdomas, ka jebkādi tādi dati tiek \"atmazgāti\".</p>",
        "id": 409724854,
        "sender_full_name": "Rihards Olups",
        "timestamp": 1703344554
    },
    {
        "content": "<p>Domāju, ka iegūt jau LĢIA drīkst, jautājums par tiesībām izplatīt konkrētos objektus kā atvertos datus.</p>",
        "id": 409725236,
        "sender_full_name": "Dāvis Kļaviņš",
        "timestamp": 1703344827
    },
    {
        "content": "<p>Kā jebkādus datus jau principā.<br>\nLĢIA dati tiek izmantoti pašvaldībās utt - iegūšana garantē izplatīšanu.</p>",
        "id": 409730293,
        "sender_full_name": "Rihards Olups",
        "timestamp": 1703348714
    }
]