[
    {
        "content": "<p>Hi everyone,</p>\n<p>(Below I'm including a Latvian translation of this message, created using DeepL.)</p>\n<p>My team at TomTom is continuing to look into issues in the map that we can fix to help improve the road network quality in Latvia. We have identified 44 situations in which two or more highways are connected to the same node on a roundabout. Fixing these cases helps improve the navigation experience in routing applications relying on OSM data, specifically the guidance when entering or exiting a roundabout.</p>\n<p>To allow our editing team to assess and, if needed, correct these situations, we’ve created a MapRoulette challenge: “<strong><a href=\"https://maproulette.org/browse/challenges/42317\">Fix Incorrect Junctions on Roundabouts</a></strong>”.<br>\nOur editors may pick up this challenge in a couple of weeks or so. As always, it is public, so anyone who’s interested can take a look at the potential issues we detected.</p>\n<p>If you have any questions or comments, just shout.</p>\n<p>Enjoy your day!<br>\nMarjan</p>\n<hr>\n<p>Sveiki visiem,</p>\n<p>Mana TomTom komanda turpina meklēt problēmas kartē, kuras mēs varam novērst, lai palīdzētu uzlabot ceļu tīkla kvalitāti Latvijā. Esam identificējuši 44 situācijas, kurās divi vai vairāki autoceļi ir savienoti ar vienu un to pašu apļveida krustojuma mezglu. Šo gadījumu novēršana palīdz uzlabot navigācijas pieredzi maršrutēšanas lietojumprogrammās, kas balstās uz OSM datiem, jo īpaši norādes, iebraucot vai izbraucot no apļveida krustojuma.</p>\n<p>Lai mūsu rediģēšanas komanda varētu novērtēt un, ja nepieciešams, labot šīs situācijas, esam izveidojuši MapRoulette izaicinājumu: \"<strong><a href=\"https://maproulette.org/browse/challenges/42317\">Fix Incorrect Junctions on Roundabouts</a></strong>\".<br>\nMūsu redaktori šo izaicinājumu var risināt aptuveni pēc pāris nedēļām. Kā vienmēr, tas ir publiski pieejams, tāpēc ikviens interesents var aplūkot mūsu atklātās iespējamās problēmas.</p>\n<p>Ja jums ir kādi jautājumi vai komentāri, vienkārši zvaniet.</p>\n<p>Izbaudiet savu dienu!<br>\nMarjan</p>",
        "id": 402400820,
        "sender_full_name": "MarjanVandeKauter",
        "timestamp": 1700118771
    },
    {
        "content": "<p>Curiously, DeepL translated \"just shout\" as \"just call\" :)</p>",
        "id": 402406938,
        "sender_full_name": "Rihards Olups",
        "timestamp": 1700121072
    },
    {
        "content": "<p>Good thing I didn't add my phone number <span aria-label=\"grinning face with smiling eyes\" class=\"emoji emoji-1f601\" role=\"img\" title=\"grinning face with smiling eyes\">:grinning_face_with_smiling_eyes:</span></p>",
        "id": 402407639,
        "sender_full_name": "MarjanVandeKauter",
        "timestamp": 1700121369
    },
    {
        "content": "<p>Looked at <a href=\"https://maproulette.org/challenge/42317/task/198023815\">https://maproulette.org/challenge/42317/task/198023815</a> , changed it - but then undid my changes.<br>\nIn this case drivers can pass from the road to the south onto the roundabout, thus attaching that road to the trunk segment that leads away from the roundabout would make things worse. That is, unless there's a \"right only\" sign going north.<br>\nThoughts on how to address this?</p>\n<p><a href=\"/user_uploads/49624/a4c06EVTNZFmH6re3BZCXHZS/image.png\">roundabout connection</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/49624/a4c06EVTNZFmH6re3BZCXHZS/image.png\" title=\"roundabout connection\"><img src=\"/user_uploads/49624/a4c06EVTNZFmH6re3BZCXHZS/image.png\"></a></div>",
        "id": 402408680,
        "sender_full_name": "Rihards Olups",
        "timestamp": 1700121769
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"568771\">@Rihards Olups</span> thanks for pointing this task out, let me take this to my team and get back to you</p>",
        "id": 402446198,
        "sender_full_name": "MarjanVandeKauter",
        "timestamp": 1700133560
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"568771\">@Rihards Olups</span>, to come back to the question you asked last week about this task: <a href=\"https://maproulette.org/challenge/42317/task/198023815\">https://maproulette.org/challenge/42317/task/198023815</a><br>\nYou're right that the road coming in from the south shouldn't be connected to the trunk segment leading away from the roundabout. I'm attaching a picture of the correction we had in mind. Let me know if this makes sense.<br>\n<a href=\"/user_uploads/49624/OVGHdAONyUDL9JDcD96JLtcy/renditionDownload.jpg\">renditionDownload.jpg</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/49624/OVGHdAONyUDL9JDcD96JLtcy/renditionDownload.jpg\" title=\"renditionDownload.jpg\"><img src=\"/user_uploads/49624/OVGHdAONyUDL9JDcD96JLtcy/renditionDownload.jpg\"></a></div>",
        "id": 403162705,
        "sender_full_name": "MarjanVandeKauter",
        "timestamp": 1700484453
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"568771\">Rihards Olups</span> <a href=\"#narrow/stream/358602-general/topic/Fixing.20incorrect.20junctions.20on.20roundabouts/near/402406938\">said</a>:</p>\n<blockquote>\n<p>Curiously, DeepL translated \"just shout\" as \"just call\" :)</p>\n</blockquote>\n<p>I mean, \"just shout\" isn't really an English expression - just shout what? They probably meant to say \"<a href=\"https://www.merriam-webster.com/dictionary/give%20%28someone%29%20a%20shout\">just give us a shout</a>\" - which DeepL would have faithfully translated to \"vienkārši sazinieties ar mums\" (just get in touch with us). Anyway, maximum nitpicking <span aria-label=\"upside down\" class=\"emoji emoji-1f643\" role=\"img\" title=\"upside down\">:upside_down:</span> <span aria-label=\"thread\" class=\"emoji emoji-1f9f5\" role=\"img\" title=\"thread\">:thread:</span></p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://www.merriam-webster.com/dictionary/give%20%28someone%29%20a%20shout\" style=\"background-image: url(https\\:\\/\\/uploads\\.zulipusercontent\\.net\\/000f7233e7153c7894c09285de6ace8e16acdefb\\/68747470733a2f2f6d65727269616d2d776562737465722e636f6d2f6173736574732f6d772f7374617469632f736f6369616c2d6d656469612d73686172652f6d772d6c6f676f2d323435783234354031782e706e67)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://www.merriam-webster.com/dictionary/give%20%28someone%29%20a%20shout\" title=\"Definition of GIVE (SOMEONE) A SHOUT\">Definition of GIVE (SOMEONE) A SHOUT</a></div><div class=\"message_embed_description\">to tell (someone) about something when it happens or is ready to be done… See the full definition</div></div></div>",
        "id": 403164533,
        "sender_full_name": "HellMap",
        "timestamp": 1700485165
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"636837\">MarjanVandeKauter</span> <a href=\"#narrow/stream/358602-general/topic/Fixing.20incorrect.20junctions.20on.20roundabouts/near/403162705\">said</a>:</p>\n<blockquote>\n<p>[..] correction we had in mind [..]</p>\n</blockquote>\n<p>I guess it would help to understand what is incorrect about the \"multiple highways connect to same node at roundabout\" and what problem does it create for the router? The task description asks <em>what</em> to do doesn't really explain <em>why</em> to do it. As someone with passing knowledge of routing software and how I would implement this, the navigator would say \"turn right into second road\" or something like that. So may be I'm not understanding the actual error that is caused by this example?</p>",
        "id": 403165216,
        "sender_full_name": "HellMap",
        "timestamp": 1700485375
    },
    {
        "content": "<p>I realize this is all very naive from me. But as a driver, driving from West exiting to trunk, I would expect the navigator to say something like \"exit the roundabout, keep straight\". Since the navigator is (hopefully) trying to disambiguate instructions within an area, it would realize that there are two options - \"turn right\" and \"go straight\". Picking \"go straight\" disambiguates the instruction. But - and this is confusing me - why does it matter where the roads connect? May be I am overly optimistic about current navigator implementations, but surely the navigator won't consider a few meters as a different intersection?</p>",
        "id": 403170210,
        "sender_full_name": "HellMap",
        "timestamp": 1700487083
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"636837\">MarjanVandeKauter</span> <a href=\"#narrow/stream/358602-general/topic/Fixing.20incorrect.20junctions.20on.20roundabouts/near/403162705\">said</a>:</p>\n<blockquote>\n<p>Hi <span class=\"user-mention silent\" data-user-id=\"568771\">Rihards Olups</span>, to come back to the question you asked last week about this task: <a href=\"https://maproulette.org/challenge/42317/task/198023815\">https://maproulette.org/challenge/42317/task/198023815</a><br>\nYou're right that the road coming in from the south shouldn't be connected to the trunk segment leading away from the roundabout. I'm attaching a picture of the correction we had in mind. Let me know if this makes sense.<br>\n<a href=\"/user_uploads/49624/OVGHdAONyUDL9JDcD96JLtcy/renditionDownload.jpg\">renditionDownload.jpg</a></p>\n</blockquote>\n<p>While that doesn't correctly represent the actual layout, it might be OK to warp it a little bit in some cases.<br>\nIn this case, wouldn't the proposed layout make the routing solution go \"take the first exit\" (meaning the one that goes south) - but the user might interpret that as \"there's an exit that has a minor road attached to it, so I have to go straight east\"?</p>",
        "id": 403364559,
        "sender_full_name": "Rihards Olups",
        "timestamp": 1700567484
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"571825\">@HellMap</span> <span class=\"user-mention\" data-user-id=\"568771\">@Rihards Olups</span> sorry it took me a little while to respond. I was discussing your comments with my team.</p>\n<p>So, as mentioned in the challenge description, the <a href=\"https://wiki.openstreetmap.org/wiki/Tag:junction%3Droundabout#:~:text=of%20that%20routes.-,Connecting%20ways,-Connect%20the%20approaching\">OSM wiki</a> explains that ways entering and exiting a roundabout shouldn't be connected to the same node:</p>\n<p>\"Do not directly connect approaching with departing roads. <br>\nRoundabout with correct connections<br>\nEach way which intersects with the roundabout should be connected to it with a separate node. Two ways which enter and exit a roundabout should never connect to the same node on the roundabout. This is required to allow routing applications and software to provide correct directions, otherwise the routing software will not correctly recognise the roundabout. With a segment of the roundabout between the entrance and exit, routers can safely recognise that a section of the roundabout has to be driven through.\"</p>\n<p>If there is no stretch of roundabout between the entering and exiting way, the routing application won't correctly recognize the roundabout and won't be able to give the right instructions (it might give an instruction like \"turn right\" instead of \"take the first exit\").</p>\n<p>For the sake of consistency, it's better if this logic is applied to all road types, because when is a road major enough to be considered an exit? I think it's difficult to get a human consensus on this.</p>\n<p>Let me know if you have any follow-up remarks! And have a great weekend.</p>",
        "id": 403920195,
        "sender_full_name": "MarjanVandeKauter",
        "timestamp": 1700814018
    },
    {
        "content": "<p>Yeah, that wiki section is well-known, but not quite sure about the practical aspects there - wiki does not explain what exact problems are there with routing, why routing software couldn't take two ways at the same node and just count them as exits, if desired. This might stem from my lack of geo-solution experience. Is that a specific problem you are experiencing with routing applications?</p>\n<p>In this particular case, I'd say that humans might not even agree how many roundabout exits are there, as somebody might count them as two separate exits, somebody might say it's one exit with a minor road detaching.</p>\n<p>I don't have a strong opinion on this one - deferring to other community members.</p>",
        "id": 403924751,
        "sender_full_name": "Rihards Olups",
        "timestamp": 1700815972
    },
    {
        "content": "<p>I guess I would just mirror what Rihards said. Wiki has the same problem - it explains what to do and not really <em>why</em> the problem happens in routers. Like, for the example above, if the router told me to \"take the second exit\", I would have driven past the exit, because I would consider those two roads to be the same exit branching into two possible directions. I guess it's just really weird why this is a problem for roundabouts when every other road, path, etc. commonly has multi-way connections? As far as I know, this sort of splitting is not applied elsewhere. After all, there are endless examples of junctions with near-identical exit directions.</p>",
        "id": 403938507,
        "sender_full_name": "HellMap",
        "timestamp": 1700821111
    },
    {
        "content": "<p>Here's a more fun interconnected roundabout example with entire 4 multi-connections <a href=\"https://www.openstreetmap.org/#map=19/57.31218/25.31840\">https://www.openstreetmap.org/#map=19/57.31218/25.31840</a> <br>\n<a href=\"/user_uploads/49624/odlF2iQu7gbOvwdcyMXvIPGG/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/49624/odlF2iQu7gbOvwdcyMXvIPGG/image.png\" title=\"image.png\"><img src=\"/user_uploads/49624/odlF2iQu7gbOvwdcyMXvIPGG/image.png\"></a></div><div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://www.openstreetmap.org/#map=19/57.31218/25.31840\" style=\"background-image: url(https\\:\\/\\/uploads\\.zulipusercontent\\.net\\/6216f4773cbede236f0589ddcc1cf59e83a3b7bb\\/68747470733a2f2f7777772e6f70656e7374726565746d61702e6f72672f6173736574732f6f736d5f6c6f676f5f3235362d656430323866393034363832323461323732393631633338306563656530636662373362383034386233346634623462323034623766306431303937383735642e706e67)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://www.openstreetmap.org/#map=19/57.31218/25.31840\" title=\"OpenStreetMap\">OpenStreetMap</a></div><div class=\"message_embed_description\">OpenStreetMap is a map of the world, created by people like you and free to use under an open license.</div></div></div>",
        "id": 403938622,
        "sender_full_name": "HellMap",
        "timestamp": 1700821160
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"568771\">@Rihards Olups</span> <span class=\"user-mention\" data-user-id=\"571825\">@HellMap</span> thanks for elaborating on this. I have to be honest and say that I'm not able to answer this question, so let me dig into this some more and get back to you.</p>",
        "id": 404373889,
        "sender_full_name": "MarjanVandeKauter",
        "timestamp": 1701079002
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"568771\">@Rihards Olups</span>  <span class=\"user-mention\" data-user-id=\"571825\">@HellMap</span> coming back to this topic--while it is probably possible for navigation systems to work around these cases, we concluded based on the wiki that others also consider these situations as needing fixing in OSM. However, if there is no consensus on this in the Latvian community, we could make this challenge indiscoverable or archive it. Let me know what you think.</p>",
        "id": 408577459,
        "sender_full_name": "MarjanVandeKauter",
        "timestamp": 1702894624
    },
    {
        "content": "<p>Thank you for looking into this. The wiki section could be outdated or mistaken - OSM wiki not always is 100% correct.<br>\nIf the TomTom team has not experienced specific problems in this area, it might be worth archiving the challenge to avoid potentially useless work.</p>",
        "id": 408620610,
        "sender_full_name": "Rihards Olups",
        "timestamp": 1702909025
    },
    {
        "content": "<p>Yeah, I don't really have anything to add either. As I mentioned, there are many examples of similar multi-way joined intersections, so I am not understanding the issue. I am tempted to say that the wiki is just wrong. This was originally <a href=\"https://wiki.openstreetmap.org/w/index.php?title=Tag:junction%3Droundabout&amp;diff=1048707&amp;oldid=1048702\">added to wiki in 2014</a> with no real explanation. This has then stuck through until today. I don't think any examples of routers working or not working have been given to support this statement. I guess we can ask the user where they got the practice from.</p>",
        "id": 408628383,
        "sender_full_name": "HellMap",
        "timestamp": 1702911477
    },
    {
        "content": "<p>FYI we also discussed this topic with other communities, and some of them do actually agree that these cases should be fixed, and that these edits would not just be useful for TomTom. It seems like the wiki isn't necessarily outdated, but there's no consensus on the matter across countries.</p>\n<p>But like I said, since your community does not agree with this mapping practice, we can archive this challenge.</p>",
        "id": 408839596,
        "sender_full_name": "MarjanVandeKauter",
        "timestamp": 1702973591
    },
    {
        "content": "<p>Quick update: we archived the challenge now</p>",
        "id": 408859332,
        "sender_full_name": "MarjanVandeKauter",
        "timestamp": 1702976884
    },
    {
        "content": "<p>Thank you so much for looking into this.<br>\nWhen you say \"these cases should be fixed\", what is the problem that needs fixing?</p>",
        "id": 408882233,
        "sender_full_name": "Rihards Olups",
        "timestamp": 1702980976
    },
    {
        "content": "<p>Yeah, it's not that I am necessarily opposed to this being \"fixed\", I just similarly want to know what the problem is exactly. Because if this is a problem, then shouldn't many other multi-way intersections be a problem too?</p>",
        "id": 408884702,
        "sender_full_name": "HellMap",
        "timestamp": 1702981373
    },
    {
        "content": "<p>The structure of a roundabout is more complex and different navigation instructions are needed.</p>\n<p>If, for instance, there’s a regular 5-way intersection, this intersection is a decision point, and in that location we can accurately describe what the user needs to do here (for example “go straight” or “take the second road leading to the right”).</p>\n<p>If on a roundabout, two exiting ways are connected to the same node, we can’t handle that intersection the same way we would handle a regular intersection. We don’t want to give a “take the second road leading to the right” instruction here. So, the logic used for regular multi-way intersections can’t be applied directly here.</p>\n<p>Right now these situations pose an issue for us. I don’t know if other routing engines handle these cases correctly. We concluded that creating separate nodes is good mapping practice because of the documentation on the wiki, the positive response in multiple communities, and the fact that the number of “issues” detected is limited (suggesting that in most cases, people are in fact creating separate nodes and adopting this practice). But, if a community says this isn’t good mapping practice and the routing engine logic should be able to handle these cases, we hear that.</p>",
        "id": 409356577,
        "sender_full_name": "MarjanVandeKauter",
        "timestamp": 1703154086
    },
    {
        "content": "<p>Thanks for clarifying (and putting up with our feedback haha)! I guess the thing I don't understand (since you mention you don't give instructions like “take the second road leading to the right”), what instruction would the router give here for the blue line?</p>\n<p><a href=\"/user_uploads/49624/MZTlScz7JX5f01oNjt6WDtOj/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/49624/MZTlScz7JX5f01oNjt6WDtOj/image.png\" title=\"image.png\"><img src=\"/user_uploads/49624/MZTlScz7JX5f01oNjt6WDtOj/image.png\"></a></div>",
        "id": 409359184,
        "sender_full_name": "HellMap",
        "timestamp": 1703154947
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"571825\">@HellMap</span> no problem! Re:your question, I'm actually not 100% sure, so I'm double-checking with the team working on the navigation.</p>\n<p>Starting tomorrow, I will be enjoying a two-week Christmas break, so I won't be responding here for a while. I'll be back in the new year. Meanwhile, if you have any urgent questions that can't wait until I'm back, please contact our team at osm at <a href=\"http://tomtom.com\">tomtom.com</a></p>\n<p>Enjoy the holidays, and happy New Year already!</p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"http://tomtom.com\" style=\"background-image: url(https\\:\\/\\/uploads\\.zulipusercontent\\.net\\/bcde10aa5f52b804fb11925121b62af18c525834\\/68747470733a2f2f612e73746f7279626c6f6b2e636f6d2f662f3137383436302f31323030783633302f393263353138616633352f6f675f746f6d746f6d2d6c6f676f5f313230307836333070782e6a7067)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"http://tomtom.com\" title=\"TomTom — Maps and Location Technology\">TomTom — Maps and Location Technology</a></div><div class=\"message_embed_description\">TomTom Technology for a moving world. Meet the leading independent location, navigation and map technology specialist.</div></div></div>",
        "id": 409372837,
        "sender_full_name": "MarjanVandeKauter",
        "timestamp": 1703159931
    },
    {
        "content": "<p>I suspect that this could be related to roundabout designs, too. For the most part multiple exits around the same node are avoided in real life, which could have lead to the wiki description. If some place is designed otherwise, mapping it either way could lead to potentially misleading instructions.</p>",
        "id": 409579025,
        "sender_full_name": "Rihards Olups",
        "timestamp": 1703250040
    },
    {
        "content": "<p>Hi again <span class=\"user-mention\" data-user-id=\"568771\">@Rihards Olups</span> and <span class=\"user-mention\" data-user-id=\"571825\">@HellMap</span>.</p>\n<p>First of all--happy New Year! I hope you enjoyed the holidays.</p>\n<p>I just wanted to let you know that our navigation team will be looking into correctly handling these cases on our end in the future.</p>\n<p>Enjoy the rest of your day!</p>\n<p>Marjan</p>",
        "id": 412344471,
        "sender_full_name": "MarjanVandeKauter",
        "timestamp": 1704980487
    }
]