[
    {
        "content": "<p>Piedāvāju neapvienot <a href=\"https://wiki.openstreetmap.org/wiki/Key%3Alanduse\">landuse=*</a> (piem., residential) un <a href=\"https://wiki.openstreetmap.org/wiki/Tag%3Abarrier%3Dfence\">barrier=fence</a> tagus.<br>\nDiezgan bieži tas ir aptuveni, un, šķiet, minēts. Ir īpašumi, kam sēta tikai gar ielu, dažreiz sētā ir lielāki pārrāvumi utt. Dažreiz ir posmi, kur sētas vietā ir dzīvžogs vai siena. Šādus labot sanāk grūti, tie ir tāds kā \"area\" relāciju mazais brālis :)<br>\nPiedāvāju barrier zīmēt kā atsevišķu ceļu. Vai izmantot tos pašus punktus, kurus landuse - laikam kā nu kuru reizi pagaidām.</p>\n<p>Piemēram, te es nezinu, ko lai iesāk ar šo objektu. Landuse es vēl aptuveni pielīdzinātu, bet negribu minēt, kur ir vai nav sētas.<br>\n<a href=\"/user_uploads/49624/rAZ74vsqybBqtHfr_wN_loTh/image.png\">landuse+barrier</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/49624/rAZ74vsqybBqtHfr_wN_loTh/image.png\" title=\"landuse+barrier\"><img src=\"/user_uploads/49624/rAZ74vsqybBqtHfr_wN_loTh/image.png\"></a></div>",
        "id": 320235080,
        "sender_full_name": "Rihards Olups",
        "timestamp": 1673273138
    },
    {
        "content": "<p>Arī atbalstu. Atstāj arī tādu paviršu iespaidu. Ja nav pārliecība, tad labāk neiezīmēt vispār nekā pieņemt, ka visiem privātmāju pagalmiem un industriālajām teritorijām apkārt ir žogs.</p>",
        "id": 320235871,
        "sender_full_name": "Dāvis Kļaviņš",
        "timestamp": 1673273349
    },
    {
        "content": "<p>Vēl viens piemērs, kur būtu bijis jānodala - ārpus sētas ir tādi gabali, kuri acīmredzami ir residential.<br>\nBet paga, tur nemaz no ortofoto nevar noteikt, vai ir gan dzīvžogs, gan sēta :)<br>\n<a href=\"/user_uploads/49624/Ayyp9_IEyiAefWuTeEGXandW/image.png\">residential un žogi</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/49624/Ayyp9_IEyiAefWuTeEGXandW/image.png\" title=\"residential un žogi\"><img src=\"/user_uploads/49624/Ayyp9_IEyiAefWuTeEGXandW/image.png\"></a></div>",
        "id": 320237683,
        "sender_full_name": "Rihards Olups",
        "timestamp": 1673273779
    },
    {
        "content": "<p>Šajā piemērā es vispār ņemu nost <a href=\"https://wiki.openstreetmap.org/wiki/Tag%3Abarrier%3Dfence\">barrier=fence</a> tagu un pielaboju landuse. Tad jau pareizas sētas var mikrokartēt, izpētot dabā.</p>",
        "id": 320237798,
        "sender_full_name": "Rihards Olups",
        "timestamp": 1673273815
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"571929\">Dāvis Kļaviņš</span> <a href=\"#narrow/stream/358602-general/topic/neapvienot.20landuse.3D*.20un.20barrier.3Dfence/near/320235871\">said</a>:</p>\n<blockquote>\n<p>Arī atbalstu. Atstāj arī tādu paviršu iespaidu. Ja nav pārliecība, tad labāk neiezīmēt vispār nekā pieņemt, ka visiem privātmāju pagalmiem un industriālajām teritorijām apkārt ir žogs.</p>\n</blockquote>\n<p>Arī tas, ka residential/industrial/commercial utt var iezīmēt aptuveni no ortofoto. Ja liek klāt sētu, tad pa visu perimetru par to jābūt pārliecībai, un tas tā reti ir.<br>\nSavukārt ļoti aptuveni \"kaut kur te - varbūt - ir sēta\" nešķiet lietderīgi.<br>\nPēc tam nākamais nemaz neizpētīs, jo pieņems, ka iepriekšējais zīmētājs bijis kārtīgs.</p>",
        "id": 320238206,
        "sender_full_name": "Rihards Olups",
        "timestamp": 1673273924
    },
    {
        "content": "<p>Jā, piekrītu. Tas is OSM pamatprincips - One feature, one element. Un te pat ir dažāda ģeometrija - viens ir laukums un otrs is līnija. Saprotu, ka ātrāk un vienkāršāk ir kopā, īpaši ja nav survey no visām pusēm (kas var arī nebūt iespējams). Un rediģējot pēc tam nākās atdalīt. Visādi varianti - caurums sētā, zīmē vārtus atsevišķi, sēta \"ielien iekšā\" druksu, sēta nav robeža, utt.</p>",
        "id": 320262535,
        "sender_full_name": "HellMap",
        "timestamp": 1673280134
    },
    {
        "content": "<p>Vēl viens piemērs - industrial + fence.<br>\n<a href=\"/user_uploads/49624/KpLEvQ7zqSO1S4OVlo00lcNg/image.png\">industrial + fence</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/49624/KpLEvQ7zqSO1S4OVlo00lcNg/image.png\" title=\"industrial + fence\"><img src=\"/user_uploads/49624/KpLEvQ7zqSO1S4OVlo00lcNg/image.png\"></a></div>",
        "id": 320563799,
        "sender_full_name": "Rihards Olups",
        "timestamp": 1673392729
    },
    {
        "content": "<p>Arī citu objektu un landuse savienošana (ēku, ceļu...) laikam nav vēlama, jo pamatīgi apgrūtina rediģēšanu.<br>\nSkatos, <span class=\"user-mention\" data-user-id=\"571825\">@HellMap</span> par to pat piezīmi pievienojis ;)<br>\n<a href=\"https://www.openstreetmap.org/note/3520859\">https://www.openstreetmap.org/note/3520859</a></p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://www.openstreetmap.org/note/3520859\" style=\"background-image: url(https\\:\\/\\/uploads\\.zulipusercontent\\.net\\/6216f4773cbede236f0589ddcc1cf59e83a3b7bb\\/68747470733a2f2f7777772e6f70656e7374726565746d61702e6f72672f6173736574732f6f736d5f6c6f676f5f3235362d656430323866393034363832323461323732393631633338306563656530636662373362383034386233346634623462323034623766306431303937383735642e706e67)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://www.openstreetmap.org/note/3520859\" title=\"Note: 3520859 | OpenStreetMap\">Note: 3520859 | OpenStreetMap</a></div><div class=\"message_embed_description\">OpenStreetMap is a map of the world, created by people like you and free to use under an open license.</div></div></div>",
        "id": 348077915,
        "sender_full_name": "Rihards Olups",
        "timestamp": 1681065410
    },
    {
        "content": "<p>Es tādās pavisam bēdīgās vietās esmu piezīmes atstājis, kur viss ar ceļiem savienots un vēl multipoligoni visās malās. Tur nav iespējams neko izdarīt. Daudz kur jauns ortofoto, bet izlabot ātrāk veco nonest</p>",
        "id": 348087919,
        "sender_full_name": "HellMap",
        "timestamp": 1681071435
    },
    {
        "content": "<p>Mans viedoklis: landuse &amp; barrier vienā objektā der kā ātrs pagaidu risinājums, ja dabā vai no ortofoto var saprast, ka tur patiešām iet žogs, mūris u.tml.. Protams, ilgtermiņa risinājums būtu precīzāk iezīmēt katru žogu atsevišķi ar visiem pārtraukumiem, caurumiem, paveidiem (daudzām industriālajām teritorijām tas vienubrīd ir žogs, bet tālāk jau turpinās kā mūris).</p>",
        "id": 384787801,
        "sender_full_name": "Reinis Bērziņš",
        "timestamp": 1692021419
    },
    {
        "content": "<p>Manuprāt, labāk tomēr iezīmēt žogu neprecīzi nekā neiezīmēt, jo tas tomēr ir nepārvarams. Man pašam bieži nācies griezties atpakaļ, jo priekšā ir neiezīmēts žogs. To perfekto kartēšanu var nākties gaidīt daudzus gadus. Pat, ja piezīmēs nav pierakstīts \"Fixme\", ir diezgan viegli pamanīt, ka tas ir \"ātrais risinājums\" un arī diezgan viegli nodzēst barrier tagu (daudzreiz vieglāk nekā HellMap minētajos multipoligonos, kur vienu un to pašu pliku līniju izmanto, gan landuse, gan iela, gan barjera).</p>",
        "id": 384790710,
        "sender_full_name": "Reinis Bērziņš",
        "timestamp": 1692021943
    },
    {
        "content": "<p>Bet vispār žogs dabā novelk tādu kā robežu, kuram vienā pusē ir viens \"landuse\", otrā varbūt pavisam cits (un vēl jo vairāk \"access\"), pat ja īpašniekam pieder vēl plašāks nenožogots un ar zīmēm neaizliegts zemesgabals - zāliens, iela, mežiņš u.tml.. Tādēļ, manuprāt, \"landuse\" un \"access\" lielākoties jāiet roku rokā vienā objektā, savukārt \"barrier\" jebkurā gadījumā atradīsies precīzi tajā pašā vietā - ātrajā risinājumā pievienots kā tags tam pašam landuse, bet precīzajā risinājumā kā atsevišķs objekts.</p>",
        "id": 384794415,
        "sender_full_name": "Reinis Bērziņš",
        "timestamp": 1692022557
    },
    {
        "content": "<p>Jā, sētas/žogi/sienas ir ļoti svarīgi objekti, liels paldies par to iezīmēšanu.<br>\nVarbūt tos tomēr vērts uzreiz zīmēt kā atsevišķus objektus (way), jo tad ir daudz vieglāk modificēt.<br>\nVēl arī tas, ka diviem tādiem landuse ar pievienotu \"fence\" saskaroties sanāk it kā \"dubulta sēta\". Ja vēl pievieno fence type, sanāk tipu konflikts tajā posmā, kura atrisināšana ir daudz čakarīgāka, nekā atsevišķa sētas \"way\" pievienošana.</p>",
        "id": 384794786,
        "sender_full_name": "Rihards Olups",
        "timestamp": 1692022626
    },
    {
        "content": "<p>Landuse robeža un barrier diezgan bieži nebūs vienoti. Gan residential, gan industrial, gan school utt reģioni bieži būs līdz ar kvartāla/ielu robežām, bet sētas var no tām atkāpties. Tas ir viens no scenārijiem, kur esmu īpaši pamanījis uz viena objeta saliktu tagu grūto sakārtošanu :)</p>",
        "id": 384795423,
        "sender_full_name": "Rihards Olups",
        "timestamp": 1692022744
    },
    {
        "content": "<p>Es principā īpaši kategoriski neiebilstu pret dubultegošanu landuse ar barrier kā sākotnēju risināju. Tas ir ilgtermiņā čakarīgi, bet principā sētu dati ir vairāk noderīgi nekā bez tiem. Vienīgais problēmātiski ir tur, kur sēta pārklājas ar citiem elementiem. Īpaši bieži tas nav, jo parasti visādi ceļi un ēkas ar landuse nav savienoti no sākuma, bet gadās vietas, kur piemēram ceļi šķērso sētu (tad arī access nav īsti korekti daudzviet). Piemēram (nesavienots) <a href=\"https://www.openstreetmap.org/way/1093954634\">https://www.openstreetmap.org/way/1093954634</a> pārklājas ar ceļu. Savienotu piemēru es tā uzreiz neatradīšu - tie ir krietni retāk. <br>\n<a href=\"/user_uploads/49624/uRg1pfw75tn5ZpxeLGyI6rRm/res-cross-res.png\">res-cross-res.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/49624/uRg1pfw75tn5ZpxeLGyI6rRm/res-cross-res.png\" title=\"res-cross-res.png\"><img src=\"/user_uploads/49624/uRg1pfw75tn5ZpxeLGyI6rRm/res-cross-res.png\"></a></div><div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://www.openstreetmap.org/way/1093954634\" style=\"background-image: url(https\\:\\/\\/uploads\\.zulipusercontent\\.net\\/6216f4773cbede236f0589ddcc1cf59e83a3b7bb\\/68747470733a2f2f7777772e6f70656e7374726565746d61702e6f72672f6173736574732f6f736d5f6c6f676f5f3235362d656430323866393034363832323461323732393631633338306563656530636662373362383034386233346634623462323034623766306431303937383735642e706e67)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://www.openstreetmap.org/way/1093954634\" title=\"Way: 1093954634 | OpenStreetMap\">Way: 1093954634 | OpenStreetMap</a></div><div class=\"message_embed_description\">OpenStreetMap is a map of the world, created by people like you and free to use under an open license.</div></div></div>",
        "id": 384796630,
        "sender_full_name": "HellMap",
        "timestamp": 1692022952
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"568771\">Rihards Olups</span> <a href=\"#narrow/stream/358602-general/topic/neapvienot.20landuse.3D*.20un.20barrier.3Dfence/near/384794786\">said</a>:</p>\n<blockquote>\n<p>Varbūt tos tomēr vērts uzreiz zīmēt kā atsevišķus objektus (way), jo tad ir daudz vieglāk modificēt.<br>\nVēl arī tas, ka diviem tādiem landuse ar pievienotu \"fence\" saskaroties sanāk it kā \"dubulta sēta\". Ja vēl pievieno fence type, sanāk tipu konflikts tajā posmā, kura atrisināšana ir daudz čakarīgāka, nekā atsevišķa sētas \"way\" pievienošana.</p>\n</blockquote>\n<p>Dubultā sēta ir leģitīms iemesls gan tad, ja mūris pārklājas ar sētu, kam ir dažādi simboli, gan varbūt kādā īpašā kartes stilā, kur barjeras attēlojas asimetriski. Protams, jācenšas, bet pirmajam zīmētājam jābūt gatavam ieguldīt vairāk laika.<br>\nModificēt nozīmētu: (1) izdzēst \"barrier\" tagu (šī arī ir vienīgā liekā darbība otrajam zīmētājam) un (2) iezīmēt jaunu žogu apkārt attiecīgajai teritorijai (ko neizdarīja pirmais zīmētājs, bet summā tas nebūs lieks darbs), kas vairumā gadījumu būs vienkāršāk nekā pārgriezt jau iezīmēto žogu pa segmentiem.</p>\n<blockquote>\n<p>Landuse robeža un barrier diezgan bieži nebūs vienoti. Gan residential, gan industrial, gan school utt reģioni bieži būs līdz ar kvartāla/ielu robežām, bet sētas var no tām atkāpties. :)</p>\n</blockquote>\n<p>Es gan neredzu jēgu residential, industrial un school (kas pēdējā laikā arvien vairāk tiek nožogotas) robežu zīmēt jau no ielas, ja starp ielu un žogu vēl ir brīvi pieejams, nenožogots zālājs, pa kuru brīvi staigā cilvēki (pat ja zemesgrāmatā šī teritorija pieder attiecīgajai fabrikai, skolai, privātmājas saimniekam). Un tad arī uz \"landuse\" nevarēs uzlikt \"access\" tagu. Es gan te nerunāju par brīvi pieejamiem daudzstāveņu kvartāliem, kur grūti izdomāt, kur precīzi novilkt <a href=\"https://wiki.openstreetmap.org/wiki/Tag%3Alanduse%3Dresidential\">landuse=residential</a> robežu.</p>",
        "id": 384814157,
        "sender_full_name": "Reinis Bērziņš",
        "timestamp": 1692026163
    },
    {
        "content": "<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"640767\">Reinis Bērziņš</span> <a href=\"#narrow/stream/358602-general/topic/neapvienot.20landuse.3D*.20un.20barrier.3Dfence/near/384814157\">said</a>:<br>\nDubultā sēta ir leģitīms iemesls gan tad, ja mūris pārklājas ar sētu, kam ir dažādi simboli, gan varbūt kādā īpašā kartes stilā, kur barjeras attēlojas asimetriski. Protams, jācenšas, bet pirmajam zīmētājam jābūt gatavam ieguldīt vairāk laika.<br>\nModificēt nozīmētu: (1) izdzēst \"barrier\" tagu (šī arī ir vienīgā liekā darbība otrajam zīmētājam) un (2) iezīmēt jaunu žogu apkārt attiecīgajai teritorijai (ko neizdarīja pirmais zīmētājs, bet summā tas nebūs lieks darbs), kas vairumā gadījumu būs vienkāršāk nekā pārgriezt jau iezīmēto žogu pa segmentiem.<br>\n</p>\n</blockquote>\n<p>Nebiju domājis vizualizāciju, tīri no datu struktūras viedokļa. Sētas ir līnijveida objekti. Tāpat kā citiem līnijveida objektiem (ielas, upes, grāvji, taciņas utt), šķiet, nevajadzētu pārklāties. Diviem blakus esošiem landuse pieliekot barrier līnijveida objekti pēkšņi pārklājas.</p>\n<p>Pie tam, tagad šis OSM ceļš _vienlaicīgi_ ir gan laukums, gan līnijveida objekts. T.i., te tiek pārkāpts ne tikai Hellmap dažreiz pieminētais \"one feature, one object\" princips, bet arī tiek salikti kopā divi dažādi objektu reprezentācijas veidi.</p>\n<p>Vēl kāda problēma, ko diezgan bieži novēroju - šādi pieliktas sētas ir neprecīzas. Daudz kur sēta ir tikai no ielas, vai kā citādi tikai daļēji gar/ap īpašumu. Pieliekot pa taisno landuse objektam parasti tas netiek atzīmēts. Prātīgāk šķiet sētu iezīmēt tikai tur, kur tā tiešām eksistē.</p>",
        "id": 384857804,
        "sender_full_name": "Rihards Olups",
        "timestamp": 1692034953
    },
    {
        "content": "<p>Ja esmu jau uzzīmējis noslēgtu sarežģītas formas žogu apkārt visai teritorijai un gribu ātri norādīt, ka visa šī teritorija ir <a href=\"https://wiki.openstreetmap.org/wiki/Tag%3Alanduse%3Dresidential\">landuse=residential</a> - kā visātrāk duplicēt iepriekš uzzīmēto žoga līniju?</p>\n<p>A) Var iesākt zīmēt jaunu līniju pa žoga robežu, un tad spaidīt F, bet ik pa brīdīm tas atdursies pret iebrauktuvēm u.tml. un apstāsies, tad atkal jāturpina zīmēt manuāli.<br>\nB) Nokopēt landuse teritoriju Ctrl+C &amp; Ctrl+Alt+V precīzi tajā pašā pozīcijā, nodzēst vecos žoga tagus un vietā ierakstīt <a href=\"https://wiki.openstreetmap.org/wiki/Tag%3Alanduse%3Dresidential\">landuse=residential</a> tagu, bet nodes nesalīmējas kopā. Ja pēc tam jākoriģē robeža, tad abiem elementiem atsevišķi. <strong>Vai ir iespējams šādus abus objektus iezīmēt un ātri salīmēt kopā?</strong></p>\n<p>Tātad vai nu ļoti ilgstošs A risinājums, vai ļoti neērts risinājums B visiem nākamajiem labotājiem.</p>\n<p>P.S. Pat Rīgā daudzviet aizvien ir <a href=\"https://wiki.openstreetmap.org/wiki/Tag%3Alanduse%3Dresidential\">landuse=residential</a> pāri visam mikrorajonam, kas neatbilst situācijai dabā un kas būtu jāizlabo, bet jo sarežģītāka labošana, jo ilgāk kartē būs šādas lielās neprecizitātes (pretstatā sīkajām: barrier un landuse uz viena elementa, ja dabā arī tāpat ir, tad tā pat nav neprecizitāte, bet vienkārši diskutabla tagošanas pieeja).</p>",
        "id": 430090571,
        "sender_full_name": "Reinis Bērziņš",
        "timestamp": 1711638775
    },
    {
        "content": "<p>B) es nedarītu, jā. Plus, ja kaut kādi ceļi vai kaut kas pārklājas - tad tas teorētiski paliek nepareizi/nesavienoti.</p>",
        "id": 430093050,
        "sender_full_name": "HellMap",
        "timestamp": 1711639453
    },
    {
        "content": "<p>Parasti A) ir tas, kā es to daru. Protams, ātri vien tur kaut kāda ēka vai cita teritorija un iD vairs nemāks nākošo punktu. Nezinu risinājumi, vismaz iD tāda pagaidām nav.</p>",
        "id": 430093161,
        "sender_full_name": "HellMap",
        "timestamp": 1711639490
    },
    {
        "content": "<p>Vēl teorētiski ir C) variants taisīt multipoligonus - pārvērst laukumu multipoligonā un tad ceļam (kas tagad ir multipoligona ceļš bez tegiem) pielikt to sētas tegu. Bet nu te protams uzreiz sarodas papildus multipoligoni un rediģēšana uz nākotni arī pamatīgi sarežģījas. Ja tur kaut kas klāt savienots, tad ir dubulti ceļi utt. un te var kļūt ilgāka labošana beigās. Personīgi, es to nedarītu.</p>",
        "id": 430093772,
        "sender_full_name": "HellMap",
        "timestamp": 1711639649
    },
    {
        "content": "<p>Es laikam residential zīmētu atsevišķi, nesekojot visiem mazākajiem žogu/sētu/sienu pagriezieniem.</p>",
        "id": 430096240,
        "sender_full_name": "Rihards Olups",
        "timestamp": 1711640108
    },
    {
        "content": "<p>Problēma te vēl ir arī dziļāka - jo OSM nav tādā jēdziena kā laukums/area - it tikai ceļi/ways. Un vai tas riņķveida/closed ceļš ir laukums vai līnija ir atkarīgs no tegiem. Tā kā landuse + barrier ir viens tegs laukumam un otrs tegs līnijai nav vēl tik liela problēma. Bet te ir lielāka mēroga jautājums - ko nozīmē \"atdalīt ceļu no ceļa\"? Jo konkrēta darbība ir ar konkrētiem tegiem. Un tāpēc OSM redaktoros tādas komandas īsti nav. Varbūt rich pateiks, bet JOSM arī tāda nav.</p>",
        "id": 430096335,
        "sender_full_name": "HellMap",
        "timestamp": 1711640123
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"568771\">Rihards Olups</span> <a href=\"#narrow/stream/358602-general/topic/neapvienot.20landuse.3D*.20un.20barrier.3Dfence/near/430096240\">said</a>:</p>\n<blockquote>\n<p>Es laikam residential zīmētu atsevišķi, nesekojot visiem mazākajiem žogu/sētu/sienu pagriezieniem.</p>\n</blockquote>\n<p>Nu jā, te vēl piebilde - ja vispār zīmē landuse pa sētu u.c. robežām. Es uzskatu, ka tas pārsvarā ir diezgan normāli - gan ar kadastru sakrīt, gan ar reālo vietu, kur dzīvo privāti, gan skatoties attālumus. Reti kur tā sēta ir tālu no teritorijas. Parasti ir tādas sētas, kur piemēram tikai vārti ir nedaudz dziļāk - tad landuse tā iebrauktuve arī visticamāk iekļautos. Pēc precīzas uzzīmēšanas, tur diez vai kaut kas daudz jālabo vēl, tāpēc maintenance nav tik liels. Sliktākie gadījumi ir ja pārbūvē visu - bet tad arī tas viss būs jāzīmē tik un tā.</p>",
        "id": 430097435,
        "sender_full_name": "HellMap",
        "timestamp": 1711640325
    },
    {
        "content": "<p>Jā, diezgan bieži ir tā, ka ir atstāta dziļāka iebrauktuve, šur tur pat izteikti gara, šaura svītra sanāk iekš landuse, ja to neiekļauj.<br>\nDiezgan daudz kur arī ir tā, ka daļa pa robežu ir sēta, kaut kur siena, kaut kur nekas, kaut kur tikai dzīvžogs - un te izteikti parādās ceļš vs laukums. Var jau būt, ka OSM ieviesīs atsevišķus laukumus kaut kad, un tad nāksies pilnīgi visas sētas utt atdalīt no landuse :)</p>",
        "id": 430107901,
        "sender_full_name": "Rihards Olups",
        "timestamp": 1711642439
    },
    {
        "content": "<blockquote>\n<p>Es laikam residential zīmētu atsevišķi, nesekojot visiem mazākajiem žogu/sētu/sienu pagriezieniem.</p>\n</blockquote>\n<p>Populārākie karšu attēlošanas stili <a href=\"https://wiki.openstreetmap.org/wiki/Tag%3Alanduse%3Dresidential\">landuse=residential</a> iekrāso īpašā krāsā. Tātad smukāk un precīzāk kartes lasītājam, ja landuse sakristu ar žogu (faktisko landuse robežu dabā).<br>\nJOSM un specifiski karšu attēlošanas stili dažādi attēlo, ja landuse elementam pielikts arī <a href=\"https://wiki.openstreetmap.org/wiki/Tag%3Aaccess%3Dyes\">access=yes</a> (daudzstāveņu publiski pieejamie pagalmi) vai <a href=\"https://wiki.openstreetmap.org/wiki/Tag%3Aaccess%3Dprivate\">access=private</a> (nepieejamie savrupmāju pagalmi ar žogiem un/vai dusmīgiem suņiem/saimniekiem. Tad kā uz delnas var saprast - šajā apvidū viss ir aizkrāsots ar <a href=\"https://wiki.openstreetmap.org/wiki/Tag%3Aaccess%3Dprivate\">access=private</a> un nav pat vērts mēģināt līst cauri. Agrāk JOSM validators brīdināja, ka access nedrīkst kombinēt ar vienu pašu žogu, bet tikai tad, ja tas attiecas uz landuse, amenity u.c.. Tāpēc es vēlos <a href=\"https://wiki.openstreetmap.org/wiki/Tag%3Alanduse%3Dresidential\">landuse=residential</a> u.c. teritorijas iezīmēt pēc iespējas precīzāk līdz ar dabā sastopamajām privātās telpas robežām: žogiem, dzīvžogiem, mūriem, grāvjiem u.tml..</p>",
        "id": 430311028,
        "sender_full_name": "Reinis Bērziņš",
        "timestamp": 1711742516
    },
    {
        "content": "<p>Princips \"One feature → one OSM element\" ir domāts, ka katram objektam dabā nedrīkst zīmēt 2 elementus kartē, nevis otrādi: <a href=\"https://wiki.openstreetmap.org/wiki/One_feature,_one_OSM_element\">https://wiki.openstreetmap.org/wiki/One_feature,_one_OSM_element</a></p>\n<p>Vai pieļaujama otrāda situācija - ar 1 elementu apzīmē 2 fiziskus objektus (2 tagus)? Jāskatās, vai tas nerada problēmas renderēšanā, ka populārie karšu stili mācēs attēlot tikai 1 no 2 tagiem.</p>\n<p>1 līnija un 1 laukums tajā pašā elementā varētu arī neradīt attēlošanas problēmas, jo tie nepārklājas: līnija iet apkārt, laukums ir pa vidu.<br>\nJa jau building gadījumā 1 elements ar 2 tagiem: <a href=\"https://wiki.openstreetmap.org/wiki/Tag%3Abuilding%3Dkiosk\">building=kiosk</a> &amp; <a href=\"https://wiki.openstreetmap.org/wiki/Tag%3Aamenity%3Dice_cream\">amenity=ice_cream</a> apzīmē gan fizisku ēku, gan funkciju - saldējuma tirgotavu.<br>\nTad jau arī barrier varētu tāpat: 1 elements ar 2 tagiem: <a href=\"https://wiki.openstreetmap.org/wiki/Tag%3Abarrier%3Dfence\">barrier=fence</a> &amp; <a href=\"https://wiki.openstreetmap.org/wiki/Tag%3Alanduse%3Dresidential\">landuse=residential</a> arī apzīmē gan fizisku žogu, gan funkciju - dzīvojamo teritoriju.<br>\nUn funkcija jau pat nav otrs fizisks objekts. Tas ir tikai veids, kā tiek izmantota ēkas vai žoga iekšpuse.</p>",
        "id": 430321127,
        "sender_full_name": "Reinis Bērziņš",
        "timestamp": 1711748202
    },
    {
        "content": "<p>Es tomēr ierosinu tolerēt barrier un landuse kombinēšanu tajā pašā elementā. Ja rodas vēlme un brīvs laiks šādas kombinācijas izlabot, tad tās var viegli sameklēt ar meklētāju un izdzēst lieko tagu (un pārzīmēt barrier vēlreiz, spiežot F vairākkārt).</p>\n<p>Gadījumos, kad nav laika izpētīt vai iezīmēt žogu 100% precīzi, tomēr žogs ir gandrīz no visām pusēm, no kurām var apskatīt un piekļūt svešinieki, varbūt kādā žoga posmā ir nevis žogs, bet ēkas siena, tad arī iesaku tolerēt barrier un landuse kombinēšanu kā pagaidu risinājumu, pievienojot FIXME tagu. Kad būs vairāk laika, tad izlabos precīzāk. Tomēr labāk iezīmēt vismaz aptuvenu situāciju nekā nekādu.</p>",
        "id": 430322842,
        "sender_full_name": "Reinis Bērziņš",
        "timestamp": 1711749289
    },
    {
        "content": "<p>Es personīgi neiebilstu pret landuse+barrier kā pagaidu risinājumu, ja tur nav problēmu. Nav jau vienīga pagaidu un aptuvenā lieta. Runa gan par gadījumiem, kad ir problēmas - sēta pārklājas ar mājas sienu, ar ceļiem, dabā daļas nav, dubultsēta savienotām teritorijām, utt. Kad sastopas tāds gadījums un tas laukums ir milzīgs, tad to izlabot arī prasa tik daudz laika, ka faktiski nākas to barrier noņemt un pielikt fixme via piezīmi.</p>",
        "id": 430323407,
        "sender_full_name": "HellMap",
        "timestamp": 1711749675
    },
    {
        "content": "<p>Latvijā pašlaik 4612 <a href=\"https://wiki.openstreetmap.org/wiki/Key%3Alanduse\">landuse=*</a> + <a href=\"https://wiki.openstreetmap.org/wiki/Key%3Abarrier\">barrier=*</a></p>",
        "id": 430325800,
        "sender_full_name": "HellMap",
        "timestamp": 1711751228
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"640767\">Reinis Bērziņš</span> <a href=\"#narrow/stream/358602-general/topic/neapvienot.20landuse.3D*.20un.20barrier.3Dfence/near/430321127\">said</a>:</p>\n<blockquote>\n<p>Tad jau arī barrier varētu tāpat: 1 elements ar 2 tagiem: <a href=\"https://wiki.openstreetmap.org/wiki/Tag%3Abarrier%3Dfence\">barrier=fence</a> &amp; <a href=\"https://wiki.openstreetmap.org/wiki/Tag%3Alanduse%3Dresidential\">landuse=residential</a> arī apzīmē gan fizisku žogu, gan funkciju - dzīvojamo teritoriju.</p>\n</blockquote>\n<p>Šī ir laba doma, šķiet loģiski :)<br>\nSaprotu arī vēlmi ātrāk un vienkāršāk iezīmēt funkcionāli vēlamo. Galu galā gan OSM, gan jebkura cita karte ir kompromiss starp iespējamo un ideālo detalizāciju.</p>\n<p>Papildus minētajiem iemesliem (pārklāšanās ar ēku, starp diviem blakus esošiem landuse, dabā neesošu nozīmīgu posmu parādīšanās utt) no zīmēšanas pieredzes man tā arī šķiet tāda kā pārlieka detalizācija.<br>\nTeritoriālajos plānos ir dzīvojamās apbūves zonas, un tās lielākoties ir plašāki reģioni - tas apmēram ir tas, kā man šie landuse šķiet uzturamāki. Ja kāds zemes īpašnieks ievieto vārtus dziļāk sētā, kādam ārpus sētas īpašumā ir puķu dobes un mauriņš... kur tad būtu landuse robeža?<br>\nUn tas ilgtermiņā ir svarīgi ne tikai no sākotnējās iezīmēšanas skatupunkta, bet arī no uzturēšanas (pārvietoja sētu, kas notiek ar landuse) un konsekventas pieejas (viens kartētājs izzīmēja landuse gar robotu sētu, otrs nomainīja uz taisnu gar ielu, pirmais atkal pārtaisīja par robotu...) skatupunktiem.<br>\nUn ja vēl sēta, redzamais izmantojums un zemes gabala robeža ir trīs dažādas lietas, tur tak vispār nebūs skaidrs, kur likt landuse robežas.</p>\n<p>Bet tiešām saprotu vēlmi iezīmēt ātrāk, un \"tolerēt kā pagaidu risinājumu\" jau arī ir šībrīža defacto situācija :)<br>\nŠo pat būtu jauki apspriest klātienē, bakstoties kādā rediģēšanas softā un aplūkojot pamanītus/pieredzētus gadījumus.</p>",
        "id": 430981852,
        "sender_full_name": "Rihards Olups",
        "timestamp": 1712144298
    }
]