[
    {
        "content": "<p>Mazais atgādinājums, ka nosaukumus un visu citu rakstām maksimāli gramatiski pareizi latviski - nav mums tāda \"title case\".<br>\nTātad būs \"Kaķu draugu veikals\", nevis angliskots \"Kaku Draugu Veikals\".</p>",
        "id": 508361933,
        "sender_full_name": "Rihards Olups",
        "timestamp": 1743017407
    },
    {
        "content": "<p>So correct naming for <code>operator</code> of ticket vending machines (in Riga) would be \"Rīgas satiksme\" not \"Rīgas Satiksme\", right?<br>\nAnd if so, is it acceptable to batch replace those operators using level0?</p>",
        "id": 574317377,
        "sender_full_name": "markalex",
        "timestamp": 1771341686
    },
    {
        "content": "<p>Stuff like \"Rīgas satiksme\" is based on Latvian grammar because it's an official name and has to follow those rules. But they don't HAVE to, all government names just do. There's a long list of rules about which words have the capital letters in official names. But OSM is a worldwide map, not a Latvia map, so whatever local grammatrical rules a language may or may not have only apply to those common names that choose to follow them. OSM only sometimes adjusts to not have ridiculous branding (like all caps or something). But if it's \"Kaķu Draugu Veikals\", then that's what it is. I know myself and rich disagree on this. But <a href=\"https://wiki.openstreetmap.org/wiki/Key%3Aname\">name=*</a> OSM wiki has always been ground truth first, local stuff later, i.e. \"If the name isn't present on any signs, follow the local spelling rules.\" To me, focusing on title case specifically is rather arbitrary. I mean, what about Xs in Maxima XXX or apostrophe in McDonald's or exclamation mark in top! etc.? To me, that's like saying - \"remember, don't use 'x' in Latvia, there is no such letter, it's 'Maksima KsKsKs'\" <span aria-label=\"upside down\" class=\"emoji emoji-1f643\" role=\"img\" title=\"upside down\">:upside_down:</span> Why is one shop \"allowed\" to break rules, but another isn't?</p>",
        "id": 574324483,
        "sender_full_name": "HellMap",
        "timestamp": 1771343408
    },
    {
        "content": "<p>I start remembering this discussion from some other chat, with that specific example of Maxima =)</p>",
        "id": 574327430,
        "sender_full_name": "markalex",
        "timestamp": 1771344191
    },
    {
        "content": "<p>Yeah, <a class=\"stream-topic\" data-stream-id=\"358602\" href=\"/#narrow/channel/358602-general/topic/Top.21.20vai.20top.21.20.3F/with/442474766\">#general &gt; Top! vai top! ?</a> I didn't write anything here originally, since there wasn't anything new to add to the previous stuff</p>",
        "id": 574327887,
        "sender_full_name": "HellMap",
        "timestamp": 1771344309
    },
    {
        "content": "<p>Hmm, \"gramatically correct names\" has been OSM standard practice for a very long time - same as ground truth, but the latter is more about \"what appears on the sign\", not \"how exactly it is stylised\".<br>\nThe canonical example being toys'r'us, in Latvia we should strive to keep the correct capitalisation as much as possible.</p>\n<p>\"X\" seems to be a bit of a red herring. If it's part of a name in English, then it follows the rules in English. If it's a symbolic string like X-XX-XXX or CCC, more or less anything goes, as long as it's consistent and not too counterintuitive.</p>\n<p>And obviously there will be edge cases, or otherwise non-trivial situations. Maybe semi-portmanteau like \"AlkOutlet\" or... many others I don't recall right now :)<br>\nThose can be discussed individually and some consistent spelling can be used.</p>\n<p>\"Rīgas satiksme\" even seems to use the correct spelling more or less everywhere, so that seems very reasonable to fix :)</p>",
        "id": 576351158,
        "sender_full_name": "Rihards Olups",
        "timestamp": 1772227255
    }
]