[
    {
        "content": "<p>Sveiki. Esmu jauniņā/iesācējs. Strādāju par pastnieci un kādā jaukā dienā pie kādas adreses satiku \"aizdomīgu puisi\", kurš ar telefonu un go pro kameru staigājās gar ēku. Tā nu parunājām, un izrādās, viņš dara labu darbu, uzlabo OpenStreetMap . uzaicināja mani pievienoties šim čatam, ja gadījumā vēlos palīdzēt uzlabot karti.  Tad nu lūk:  <br>\nJums ir pamatīgs juceklis Dreiliņos, Robežu ielā.... tur ir daudz jaunceltņu, daudzstāvu dzīvokļu mājas, bet kartē ir bardaks. Kartē ir tas kas nav dabā un otrādi, kartē nav, bet dabā ir. Ja salīdzina ar Baltic maps, tur ēkas ir atzīmētas pareizi, BET piebraucamie vienvirziena ceļi pamatīgā ķiselī. Pēc fakta 95% ir vienvirziena ceļi no lielākā numura uz mazāko pa rinķi, izņemot 5.māju, kur var braukt abos virzienos.  Mazā Robežu ir vēl plānā, ceļas, bet Nr.2 dabā nav. Robežu iela Nr.17 ir pilnība apdzīvota 50 dzīvokļu ēka.</p>",
        "id": 364958868,
        "sender_full_name": "KristyNes",
        "timestamp": 1686341078
    },
    {
        "content": "<p><a href=\"#narrow/stream/360538-ies.C4.81c.C4.93ju-jaut.C4.81jumi/topic/Dreili.C5.86u.20jaunceltnes/near/364958868\">A message</a> was moved here from <a class=\"stream-topic\" data-stream-id=\"360538\" href=\"/#narrow/stream/360538-ies.C4.81c.C4.93ju-jaut.C4.81jumi/topic/Construction\">#iesācēju jautājumi &gt; Construction</a> by <span class=\"user-mention silent\" data-user-id=\"571825\">HellMap</span>.</p>",
        "id": 364959412,
        "sender_full_name": "Notification Bot",
        "timestamp": 1686341269
    },
    {
        "content": "<p>Jā, ar tām Dreiliņu dzīvokļu mājām ir kā ir. Tur katra māja vaļā pirms vēl nākamā uzbūvēta. Tāpēc baigais darbs to ik pēc katras mājas zīmēt. Savā laikā pats tur zīmēju un mūsu aizdomīgais tipiņš arī tur zīmējās.</p>",
        "id": 364959925,
        "sender_full_name": "HellMap",
        "timestamp": 1686341432
    },
    {
        "content": "<p>Un vēl , Dreiliņos, Paleju iela no 1. līdz 10. ir atvērta iela,  piekļve no Skuju ielas un mājas jau dažas apdzīvotas, vismaz 2., 4. un 9. 100%</p>",
        "id": 364960325,
        "sender_full_name": "KristyNes",
        "timestamp": 1686341562
    },
    {
        "content": "<p>Tur daudzas mājās kartē ir atzīmētas kā vēl būvniecībā, bet (galvenā) karte tās zīmē bez atšķirības no jau uzbūvētām. Sanāk nedaudz tizli, jo vizuāli atšķirt nevar. 4 un 17 pārliksim uz gatavu. Par 19 un 21 nevaru pateikt tā uzreiz, drošvien jau arī gatavas, jo ir \"agrāk\" par 17 uz ielas, kas esot gatav. 15 nemācēšu pateikt.</p>",
        "id": 364961154,
        "sender_full_name": "HellMap",
        "timestamp": 1686341828
    },
    {
        "content": "<p>Robežu 21, 19, 17, 15, 13, 11, 9, 7, 5, 3,1 , visas nepāra no 21-1 ir gatavas un apdzīvotas. Mazā Robežu gatavas un apdzīvotas ir 4 un 5 , bet 3 ir gandrīz pabeigta.</p>",
        "id": 364961498,
        "sender_full_name": "KristyNes",
        "timestamp": 1686341955
    },
    {
        "content": "<p>Saliku tā, paldies par info. Ceļus gan tur būs jāpēta uz vietas vai arī no kaut kādiem terplāniem, kas ir baigas darbs.</p>",
        "id": 364962150,
        "sender_full_name": "HellMap",
        "timestamp": 1686342160
    },
    {
        "content": "<p>Tur jau tā lieta, ka piemēram BalticMaps / Jāņa Sēta - viņiem jau par to maksā algas, ka viņi cītīgi no plāniem un kadastriem un (laikam) dabā to visu pēta un zīmē un vispār seko centīgi līdzi visiem projektiem. OSM visi brīvprātīgie un Latvijā galīgi nav tik daudz cilvēku. Laukos vispār vāks.</p>",
        "id": 364962347,
        "sender_full_name": "HellMap",
        "timestamp": 1686342238
    },
    {
        "content": "<p>Un tā kā mums jauns ortofoto ir tikai ik pēc kādiem 3 gadiem, tad tas viss ir ļoti grūti zīmējams tādās blīvās vietās, kā šeit.</p>",
        "id": 364962633,
        "sender_full_name": "HellMap",
        "timestamp": 1686342316
    },
    {
        "content": "<p>pie katras mājas sakot no 21. ir vienvirziena piebraucamais ceļš ar skujveida parkingiem, pa rinķi no 21 uz 19, nākamais dubultrinķis pie 17 mājas, tad rinķis no 15 uz 13 un dubultriņkis pie 11, tad ir dubultrinķis pie 9., metru zemāk dubultrinķis pie 7, pie 5. mājas var braukt abos virzienos, bet ja grib brauk uz 3, tad tur atkal no 5. mājas tikai vienā virzienā, un piebraucamo ceļu pie 1. mājas es pati vēl īsti neesmu sapratusi, bet izskatās, ka tur var piebraukt uzreiz pirmajā pagriezienā pa kreisi no sakotnējās iebrauktuves un arī tikai vienvirziena uz 3. ēkas pusi virzienā uz apli. Mazā Robežu pēc apļa labajā pusē ir vienvirziena ceļš gar 4.māju un kreisajā pusē ir divvirzienu ceļš, kas beigās sadalās dubultapļa vienvirziena ceļā pa kreisi un tad atpakaļ gar māju.... kaut kā tā</p>",
        "id": 364963507,
        "sender_full_name": "KristyNes",
        "timestamp": 1686342619
    },
    {
        "content": "<p>Paleju ielā pielaboju. Pārējos pagaidām atstāju kā būvniecības, bet drošvien varēs drīz mainīt uz gataviem. Garām braucot pa Garo ielu tur it kā jau mājas gatavas. Biju tur ļoti nesen, bet pašā Paleju ielā no Skuju neibraucu. No Ērgļu puses Palejas iela uz abiem virzieniem bija ciet.</p>",
        "id": 364963578,
        "sender_full_name": "HellMap",
        "timestamp": 1686342639
    },
    {
        "content": "<p>Tā arī ir ar Paleju ielu, No Ērgļu ielas pagaidām viss ciet, bet no Skuju līdz 10 mājai var piebraukt</p>",
        "id": 364963865,
        "sender_full_name": "KristyNes",
        "timestamp": 1686342738
    },
    {
        "content": "<p>Kaut ko aptuveni iezīmēju, paldies. Bet pagrūti no teksta īsti pareizi salikt.</p>",
        "id": 364964558,
        "sender_full_name": "HellMap",
        "timestamp": 1686342997
    },
    {
        "content": "<p>Robežu 1., 3. un 5. ir pabeigtas pirms pēdējā ortofoto - tāpēc tur viss ir sazīmēts precīzi. Varbūt kaut kādas mazas izmaiņās vai zīmes izmainījušās, bet nekam lielam nevajadzētu būt.</p>",
        "id": 364964687,
        "sender_full_name": "HellMap",
        "timestamp": 1686343042
    },
    {
        "content": "<p>Pie Mazās Robežu 5. aizdomīgais arī bija piezīmējis, bet bez ortofoto protams viss ļoti aptuveni. Te vēl ir, ka viņš tro visu teorētiski filmē un tāpēc var no tā zīmēt - <a href=\"https://www.mapillary.com/app/?pKey=965590927954629&amp;focus=photo\">https://www.mapillary.com/app/?pKey=965590927954629&amp;focus=photo</a> . Bet protams tas arī ir diezgan krietns darbs. Pats viņš līdz tam arī netiek lielākajā daļā gadījumu.</p>",
        "id": 364965093,
        "sender_full_name": "HellMap",
        "timestamp": 1686343178
    },
    {
        "content": "<p>Vispār viņš tur visur izbraucis, tikai neko nav iezīmējis. Būs jāveic pārrunas <span aria-label=\"grinning face with smiling eyes\" class=\"emoji emoji-1f601\" role=\"img\" title=\"grinning face with smiling eyes\">:grinning_face_with_smiling_eyes:</span></p>",
        "id": 364965257,
        "sender_full_name": "HellMap",
        "timestamp": 1686343229
    },
    {
        "content": "<p><a href=\"/user_uploads/49624/dFmsWKrIbsX9De7tfL4R4gaG/Снимок.JPG\">Снимок.JPG</a><br>\naptuveni šādi</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/49624/dFmsWKrIbsX9De7tfL4R4gaG/Снимок.JPG\" title=\"Снимок.JPG\"><img src=\"/user_uploads/49624/dFmsWKrIbsX9De7tfL4R4gaG/Снимок.JPG\"></a></div>",
        "id": 364966272,
        "sender_full_name": "KristyNes",
        "timestamp": 1686343595
    },
    {
        "content": "<p>ļoti daudz \"ķieģeļi \"salikti .....<br>\nbet vai tos ievēro? ne vienmēr...</p>",
        "id": 364966708,
        "sender_full_name": "KristyNes",
        "timestamp": 1686343778
    },
    {
        "content": "<p>Pieliku vienvirzienus, paldies. Precīzāk gan no Google zīmēt mēs nedrīkstam - tur kartei ir autortiesību aizsardzība. Bet tevis atzīmētos virzienus pielikt varu. No augšējā apraksta principā visi ceļi ir aptuveni pielikti. Vajadzēs tikai pareizi sabīdīt vēlāk.</p>",
        "id": 364967217,
        "sender_full_name": "HellMap",
        "timestamp": 1686343953
    },
    {
        "content": "<p>Super. Man prieks, ka varēju palīdzēt. Bet nu tagad gan, jāiet gulēt....</p>",
        "id": 364967956,
        "sender_full_name": "KristyNes",
        "timestamp": 1686344208
    }
]