[
    {
        "content": "<p>I see more and more cases when building addresses in address database life don't correspond with building addresses in real life. What would be the correct way to fix this? Should we write to some \"Adresu komisija\" with request to fix the problem either in the database or in real life?</p>",
        "id": 353641951,
        "sender_full_name": "soshial",
        "timestamp": 1682657995
    },
    {
        "content": "<p>I see more and more cases when building addresses in address database life don't correspond with building addresses in real life. What would be the correct way to fix this? Should we write to some \"Adresu komisija\" with request to fix the problem either in the database or in real life?</p>",
        "id": 353642172,
        "sender_full_name": "soshial",
        "timestamp": 1682658022
    },
    {
        "content": "<p>I feel like <span class=\"user-mention\" data-user-id=\"568771\">@Rihards Olups</span> or <span class=\"user-mention\" data-user-id=\"571929\">@Dāvis Kļaviņš</span> can answer this properly. There have been some mentions about this, but I've never really dealt with it. Basically, you can e-mail either the Municipality/Council or VZD, depending on whose problem it is. I also believe it's often actually the owners of the property who have not properly updated their data with VZD after new construction or something. Like, VZD often assigns an approximate address point before there are any structures. Then the owners are supposed to submit all the territory papers and VZD should place the address point on a building. But I have no idea at which point things go wrong there. Given that there are literally tens of thousands of such misaligned points, I'm not sure how effective emailing anyone about them would be. It would be like a full-time job for multiple people to fix all these. And consider that there are literally undeclared living houses and structures avoiding taxes that are probably much higher priority for VZD.</p>",
        "id": 354343924,
        "sender_full_name": "HellMap",
        "timestamp": 1682769182
    },
    {
        "content": "<p>Indeed, there is no central authority on this. Local councils are responsible, and VZD just collates the info.<br>\nReporting this to local councils does not seem to be of any use whatsoever. For example, multiple cases with incorrect living street signs have been reported. As far as I know, none have been fixed.<br>\nWe can report these to VZD who can poke councils, having a bit more weight, but even then any fixes are more exceptions than norm.</p>",
        "id": 354469482,
        "sender_full_name": "Rihards Olups",
        "timestamp": 1682787509
    },
    {
        "content": "<p>I was mostly talking about several building in Riga, that are definitely not newly built. If this can't be fixed in Riga, I wonder how it is in smaller cities...</p>",
        "id": 355316948,
        "sender_full_name": "soshial",
        "timestamp": 1683089558
    },
    {
        "content": "<p>There are two main categories - a) Bad official address info (grammar issues, messy assignment etc); b) Incorrect signage \"on the ground\".<br>\nSome places combine both (a school or kindergarten in, was it Ogre, had both messy assignment and incorrect signage).<br>\nBoth depend on the local council paying attention, and yeah, often they do not have the resources or are not considering it to be much of a problem in the first place.<br>\nThe best we could do might be building a register of such problematic places, some attempt at that in <a class=\"stream-topic\" data-stream-id=\"358602\" href=\"/#narrow/stream/358602-general/topic/probl.C4.93mu.20re.C4.A3istri\">#general &gt; problēmu reģistri</a> .</p>",
        "id": 355448012,
        "sender_full_name": "Rihards Olups",
        "timestamp": 1683121520
    }
]